Revit 2027 API
ScheduleHorizontalAlignment Enumeration
 Horizontal alignment of data in a schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ScheduleHorizontalAlignment
Public Enumeration ScheduleHorizontalAlignment
public enum class ScheduleHorizontalAlignment
type ScheduleHorizontalAlignment
Members
Member name | Value | Description
Center | 1 |  Center aligned
Left | 0 |  Left aligned
Right | 2 |  Right aligned
See Also
Reference
Autodesk.Revit.DB Namespace